In [1]:
import pandas as pd
import numpy as np

In [2]:
sample_list=pd.Series(range(10))

In [3]:
sample_list

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [4]:
 sample_list[sample_list<3]

0    0
1    1
2    2
dtype: int64

In [5]:
 sample_list[sample_list>3]

4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [6]:
sample_list.where(sample_list < 3)

0    0.0
1    1.0
2    2.0
3    NaN
4    NaN
5    NaN
6    NaN
7    NaN
8    NaN
9    NaN
dtype: float64

In [7]:
masked_list=sample_list.mask(sample_list< 3)

masked_list

0    NaN
1    NaN
2    NaN
3    3.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [9]:
sample_list.where(sample_list>3,'DNW')

0    DNW
1    DNW
2    DNW
3    DNW
4      4
5      5
6      6
7      7
8      8
9      9
dtype: object

sample_list --shows the list).where(sample_list>3,'DNW') when a element in the list is minor to 3, is replaces it with a DNW

In [10]:
pd.Series(range(10))

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [13]:
sample_list.where(sample_list > 3, 'DNW') == pd.Series(range(10))

0    False
1    False
2    False
3    False
4     True
5     True
6     True
7     True
8     True
9     True
dtype: bool

With this kind of consultation, we change the values from numerical, it turns every value to boolean

In [16]:
df=pd.DataFrame({'color':['red','yellow','green','yellow','blue','green','green'],
                'vehicle':['truck','bus','van','truck','bus','van','car']
                })

In [17]:
df

    color vehicle
0     red   truck
1  yellow     bus
2   green     van
3  yellow   truck
4    blue     bus
5   green     van
6   green     car

In [23]:
df.duplicated('color'and'vehicle')

0    False
1    False
2    False
3     True
4     True
5     True
6    False
dtype: bool

In [25]:
  df.drop_duplicates('color')

    color vehicle
0     red   truck
1  yellow     bus
2   green     van
4    blue     bus

In [26]:
df.drop_duplicates('color',
                  keep='first')

    color vehicle
0     red   truck
1  yellow     bus
2   green     van
4    blue     bus

In [27]:
 df.drop_duplicates('color',
                  keep='last')

    color vehicle
0     red   truck
3  yellow   truck
4    blue     bus
6   green     car

This is made to preserve the last record in the dataframe

In [28]:
 df.drop_duplicates('color',
                  keep=False)

  color vehicle
0   red   truck
4  blue     bus

this shows only non duplicated columns

In [29]:
df.duplicated(['color','vehicle'])

0    False
1    False
2    False
3    False
4    False
5     True
6    False
dtype: bool

In [30]:
df.drop_duplicates(['color','vehicle'])

    color vehicle
0     red   truck
1  yellow     bus
2   green     van
3  yellow   truck
4    blue     bus
6   green     car

This only shows one record, from the duplicates.

In [31]:
pd.crosstab(df['color'],
           df['vehicle'],
           margins=True)

vehicle  bus  car  truck  van  All
color
blue       1    0      0    0    1
green      0    1      0    2    3
red        0    0      1    0    1
yellow     1    0      1    0    2
All        2    1      2    2    7

crosstab creates a table with the titles and counting of the data

1